app/controllers/books_controller.rb

SELECT  "books".* FROM "books" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
---
  def index
    #@books = Book.all
    @books=Book.paginate(page:params[:page],per_page:15)