app/controllers/grades_controller.rb

SELECT  "grades".* FROM "grades" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
---
  def index
    @grades = Grade.paginate(page:params[:page],per_page:15)