app/controllers/reports_controller.rb

  def index
    @reports = Report.paginate(page:params[:page],per_page:15)
---
SELECT  "reports".* FROM "reports" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]